In [ ]:
Q-19. Write an SQL query to determine the 5th highest salary without using TOP or limit
method.

In [ ]:
#Answer:
SELECT * FROM (SELECT ROW_NUMBER() OVER (ORDER BY salary DESC) AS R_NUM, first_name, salary FROM employee) as HEllO WHERE R_NUM=5;

In [ ]:
Q-20. Write an SQL query to fetch the list of employees with the same salary.

In [ ]:
#Answer:
CREATE TABLE employee (
    emp_id INT PRIMARY KEY AUTO_INCREMENT NOT NULL,
    first_name VARCHAR(20),
    last_name VARCHAR(20),
    salary INT
);

INSERT INTO employee VALUES
(1,'Aditya','Satam',1500),
(2,'Gaurav','Satam',2000),
(3,'Sada','Satam',500),
(4,'Snehal','Satam',1750),
(5,'Mayur','Rane',1500),
(6,'Manas','Patil',1750);

SELECT * FROM employee ORDER BY salary ASC;